In [ ]:
import pandas as pd
# import datetime as dt

In [ ]:
df = pd.read_csv('c:/users/home/documents/project_3/static/data/[City of Stonnington] ProfileDataExport.csv')

In [ ]:
df.head()

In [ ]:
df.drop(columns=['WebID', 'Data table', 'LatestERP', '2016%', '2011', '2011%', 'Data Type', 'Unnamed: 10'], axis=1, inplace=True)

In [ ]:
df.head()

In [ ]:
df = df[df['Data label' ] == 'Usual Resident Population']

In [ ]:
df.head()

In [ ]:
df.drop(columns=['Data label'], axis = 1, inplace = True)

In [ ]:
df.head()

In [ ]:
df.shape

In [ ]:
#df.to_csv("c:/users/home/documents/project_3/static/data/Stonnington_Population.csv", index=False)

In [ ]:
df = pd.read_csv('c:/users/home/documents/project_3/static/data/[City of Greater Bendigo] ProfileDataExport.csv')

In [ ]:
df.drop(columns=['WebID', 'Data table', 'LatestERP', '2016%', '2011', '2011%', 'Data Type', 'Unnamed: 10'], axis=1, inplace=True)

df = df[df['Data label' ] == 'Usual Resident Population']

df.drop(columns=['Data label'], axis = 1, inplace = True)

df.shape

In [ ]:
#df.to_csv("c:/users/home/documents/project_3/static/data/Bendigo_Population.csv", index=False)

In [ ]:
df = pd.read_csv('c:/users/home/documents/project_3/static/data/[City of Darebin] ProfileDataExport.csv')

In [ ]:
df.drop(columns=['WebID', 'Data table', 'LatestERP', '2016%', '2011', '2011%', 'Data Type', 'Unnamed: 10'], axis=1, inplace=True)

df = df[df['Data label' ] == 'Usual Resident Population']

df.drop(columns=['Data label'], axis = 1, inplace = True)

df.shape

In [ ]:
#df.to_csv("c:/users/home/documents/project_3/static/data/Darebin_Population.csv", index=False)

In [ ]:
df = pd.read_csv('c:/users/home/documents/project_3/static/data/CaseyProfileDataExport.csv', encoding= 'unicode_escape')

In [ ]:
df.columns

In [ ]:
df.drop(columns=['WebID', 'Data table', 'LatestERP', '2016%', '2011', '2011%', 'Data Type'], axis=1, inplace=True)

df = df[df['Data label' ] == 'Usual Resident Population']

df.drop(columns=['Data label'], axis = 1, inplace = True)

df.shape

In [ ]:
#df.to_csv("c:/users/home/documents/project_3/static/data/Casey_Population.csv", index=False)

In [ ]:
df = pd.read_csv('c:/users/home/documents/project_3/static/data/[Boroondara] ProfileDataExport_WeeklyIncome.csv')

In [ ]:
df.head()

In [ ]:
import pandas as pd

In [ ]:
vic_subs_popu_2019_df = pd.read_csv('c:/users/home/documents/project_3/static/data/VIC_ABS_ANNUAL_ERP_ASGS_2019.csv')

In [ ]:
vic_subs_popu_2019_df.drop(columns =['MEASURE', 'Measure', 'REGIONTYPE', 'Geography Level', 'ASGS_2016',
      'FREQUENCY', 'Frequency', 'TIME', 'Time', 'Flag Codes', 'Flags'], axis = 1, inplace=True)

In [ ]:
vic_subs_popu_2019_df.head()

In [ ]:
vic_subs_popu_2019_df['Region'] = vic_subs_popu_2019_df.Region.apply(lambda x: x.replace("- ", ""))

In [ ]:
# subs_df = vic_subs_popu_2019_df['Region']

In [ ]:
# vic_subs_popu_2019_df = vic_subs_popu_2019_df.Region.replace(" (Vic.)", "",regex=True)

In [ ]:
# vic_subs_popu_2019_df['Region'] = vic_subs_popu_2019_df['Region'].apply(lambda x: x[:x.find("(")])

In [ ]:
# vic_subs_popu_2019_df.head()

In [ ]:

# using regular expression module to clean the suburbs name

import re 
  
# Function to clean the names 
def Clean_names(Sub_name): 
    # Search for opening bracket in the name followed by 
    # any characters repeated any number of times 
    if re.search('\(.*', Sub_name): 
  
        # Extract the position of beginning of pattern 
        pos = re.search('\(.*', Sub_name).start() - 1
  
        # return the cleaned name 
        return Sub_name[:pos]
  
    else: 
        # if clean up needed return the same name 
        return Sub_name

In [ ]:
# Updated the city columns 

vic_subs_popu_2019_df['Region'] = vic_subs_popu_2019_df['Region'].apply(Clean_names)


# Print the updated dataframe 
# print(vic_subs_popu_2019_df)

In [ ]:
#vic_subs_popu_2019_df.to_csv('c:/users/home/documents/project_3/static/data/Vic_Subs_Popu_2019.csv', index= False)

In [ ]:
# vic_subs_popu_2019_df.head()

In [ ]:
# cleaning median household income data

In [ ]:
import pandas as pd

In [ ]:
df = pd.read_excel('c:/users/home/documents/project_3/static/data/[Boroondara] median-household-income.xls', header=2)

In [ ]:
df = df[0:len(df)-7]

In [ ]:
df = df.rename(columns={'Area': 'Suburb', 'Median household income ($)':'Median Income' })

In [ ]:
df

In [ ]:
df = pd.read_excel('c:/users/home/documents/project_3/static/data/[Stonnington] median-household-income.xls', header=2)

In [ ]:
df = df[0:len(df)-6]
df = df.rename(columns={'Area': 'Suburb', 'Median household income ($)':'Median Income' })
df

In [ ]:
df = pd.read_excel('c:/users/home/documents/project_3/static/data/[City of Yarra] median-household-income.xls', header=2)
#df

In [ ]:
df = df[0:len(df)-7]
df2 = df.rename(columns={'Area': 'Suburb', 'Median household income ($)':'Median Income' })
df2

In [ ]:
frames = [df, df2]
df = pd.concat(frames, ignore_index=True, sort=False)

In [ ]:
df

In [ ]:
df.columns

In [ ]:
len(lga_list)

In [80]:
import pandas as pd

In [81]:
# create a list of lga
lga_list = ['[Banyule]', '[Bendigo]', '[Boroondara]', '[City of Ballarat]', 
           '[City of Yarra]', '[Colac]', '[Darebin]', '[East Gippsland]', 
            '[Eastern Region]', '[Frankston]', '[Geelong]', '[Gippsland]',
           '[Glen Eira]', '[Grampians Shire]', '[Hobsons Bay]', 
           '[Hume City]', '[Kingston]', '[Knox]', '[Macedon]', 
            '[Manningham]', '[Maribyrnong]', '[Maroondah]', '[Melton]',
           '[Mitchell Shire Council]', '[Monash]', '[Moorabool Shire]',
           '[Moreland]', '[Mornington]', '[Port Phillip]', '[Shepparton]',
           '[South Gippsland Shire]', '[Wangaratta]', '[Warrnambool]', 
            '[Wellington Shire]', '[Whitehorse]', '[Whittlesea]', '[Wodonga]',
           '[Wyndham]', '[Yarra Ranges]']

In [217]:
df = pd.read_excel('c:/users/home/documents/project_3/static/data/median-household-income/[Banyule] median-household-income.xls', header=2)
df = df[0:len(df)-7] # slice to remove unused rows
df = df.rename(columns={'Area': 'Suburb', 'Median household income ($)':'Median Income'})

for i in range(1, len(lga_list)):

    # read excel file

    df1 = pd.read_excel(f'c:/users/home/documents/project_3/static/data/median-household-income/{lga_list[i]} median-household-income.xls', header=2)

    df1 = df1[0:len(df1)-7] # slice to remove unused rows

    # rename columns
    df1 = df1.rename(columns={'Area': 'Suburb', 'Median household income ($)':'Median Income'})


    # append to dataframe
    df = df.append(df1, ignore_index=True, sort=False)

In [222]:
type(df)

pandas.core.frame.DataFrame

In [223]:
test_df = df.copy()

In [226]:
df['Suburb'] = df['Suburb'].apply(lambda x: x.split(" -"))
df['Suburb'] = df['Suburb'].apply(lambda x: x[0])
df.head()

          Suburb  Median Income
0     Briar Hill         1604.0
1       Bundoora         1363.0
2      Eaglemont         2352.0
3  Greensborough         1634.0
4     Heidelberg         1735.0

In [230]:
import re 
  
# Function to clean the names 
def Clean_names(Sub_name): 
    # Search for opening bracket in the name followed by 
    # any characters repeated any number of times 
    if re.search('\(.*', Sub_name): 
  
        # Extract the position of beginning of pattern 
        pos = re.search('\(.*', Sub_name).start() - 1
  
        # return the cleaned name 
        return Sub_name[:pos]
  
    else: 
        # if clean up needed return the same name 
        return Sub_name

In [231]:
df['Suburb'] = df['Suburb'].apply(Clean_names)

In [232]:
df.to_csv("c:/users/home/documents/project_3/static/data/Median_Income.csv", index=False)

In [1]:
# load real estate data
import pandas as pd

In [7]:
df = pd.read_csv("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/MELBOURNE_HOUSE_PRICES_LESS.csv")

In [8]:
df.columns

Index(['Suburb', 'Address', 'Rooms', 'Type', 'Price', 'Method', 'SellerG',
       'Date', 'Postcode', 'Regionname', 'Propertycount', 'Distance',
       'CouncilArea'],
      dtype='object')

In [9]:
del_cols = ['Regionname', 'Propertycount', 'Distance']

In [10]:
df.drop(columns=del_cols, inplace=True)

In [22]:
df.tail()

,Suburb,Address,Rooms,Type,Price,Method,SellerG,Date,Postcode,CouncilArea
63018,Roxburgh Park,3 Carr Pl,3,h,566000.0,S,Raine,31/03/2018,3064,Hume City Council
63019,Roxburgh Park,9 Parker Ct,3,h,500000.0,S,Raine,31/03/2018,3064,Hume City Council
63020,Roxburgh Park,5 Parkinson Wy,3,h,545000.0,S,Raine,31/03/2018,3064,Hume City Council
63021,Thomastown,3/1 Travers St,3,u,NaN,PI,Barry,31/03/2018,3074,Whittlesea City Council
63022,Williams Landing,1 Diadem Wy,4,h,NaN,SP,Aussie,31/03/2018,3027,Wyndham City Council

In [26]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 62353 entries, 670 to 63022
Data columns (total 10 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   Suburb       62353 non-null  object
 1   Address      62353 non-null  object
 2   Rooms        62353 non-null  int64
 3   Type         62353 non-null  object
 4   Price        47910 non-null  float64
 5   Method       62353 non-null  object
 6   SellerG      62353 non-null  object
 7   Date         62353 non-null  object
 8   Postcode     62353 non-null  int64
 9   CouncilArea  62353 non-null  object
dtypes: float64(1), int64(2), object(7)
memory usage: 5.2+ MB

In [31]:
df = df[:100]

In [34]:
df.shape

(100, 10)

In [35]:
#df.to_html("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/Melbourne_House_Price.html", index=False)

In [44]:
df = pd.read_csv("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/dv279-schoollocations2019.csv")

In [37]:
df.shape

(2254, 21)

In [38]:
df.columns

Index(['Education_Sector', 'Entity_Type', 'School_No', 'School_Name',
       'School_Type', 'School_Status', 'Address_Line_1', 'Address_Line_2',
       'Address_Town', 'Address_State', 'Address_Postcode',
       'Postal_Address_Line_1', 'Postal_Address_Line_2', 'Postal_Town',
       'Postal_State', 'Postal_Postcode', 'Full_Phone_No', 'LGA_ID',
       'LGA_Name', 'X', 'Y'],
      dtype='object')

In [45]:
del_cols = ['Education_Sector', 'Entity_Type','Entity_Type', 'School_No',
            'School_Status',  'Address_Line_2', 'Address_Town', 'Address_State', 
            'Postal_Address_Line_1', 'Postal_Address_Line_2', 'Postal_Town', 
            'Postal_State', 'Postal_Postcode', 'LGA_ID', 'X', 'Y']

In [46]:
df.drop(columns=del_cols, inplace=True)

In [47]:
df.head()

,School_Name,School_Type,Address_Line_1,Address_Postcode,Full_Phone_No,LGA_Name
0,Alberton Primary School,Primary,21 Thomson Street,3971,03 5183 2412,Wellington (S)
1,Allansford and District Primary School,Primary,Frank Street,3277,03 5565 1382,Warrnambool (C)
2,Avoca Primary School,Primary,118 Barnett Street,3467,03 5465 3176,Pyrenees (S)
3,Avenel Primary School,Primary,40 Anderson Street,3664,03 5796 2264,Strathbogie (S)
4,Warrandyte Primary School,Primary,5-11 Forbes Street,3113,03 9844 3537,Manningham (C)

In [50]:
df = df.rename(columns={'School_Name': 'School Name', 'School_Type': 'School Type', 
                        'Address_Line_1': 'Address', 'Address_Postcode':'Postcode',
                       'Full_Phone_No': 'Phone #', 'LGA_Name':'LGA Name'})

In [51]:
df.head()

,School Name,School Type,Address,Postcode,Phone #,LGA Name
0,Alberton Primary School,Primary,21 Thomson Street,3971,03 5183 2412,Wellington (S)
1,Allansford and District Primary School,Primary,Frank Street,3277,03 5565 1382,Warrnambool (C)
2,Avoca Primary School,Primary,118 Barnett Street,3467,03 5465 3176,Pyrenees (S)
3,Avenel Primary School,Primary,40 Anderson Street,3664,03 5796 2264,Strathbogie (S)
4,Warrandyte Primary School,Primary,5-11 Forbes Street,3113,03 9844 3537,Manningham (C)

In [52]:
df.to_csv("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/Melbourne_Schools.csv", index=False)

df.to_html("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/Melbourne_Schools.html", index=False)

In [55]:
# loading population data

df = pd.read_csv("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/VIC_ABS_ANNUAL_ERP_ASGS2001_2019.csv")

In [57]:
df.shape

(17062, 13)

In [58]:
df.columns

Index(['MEASURE', 'Measure', 'REGIONTYPE', 'Geography Level', 'ASGS_2016',
       'Region', 'FREQUENCY', 'Frequency', 'TIME', 'Time', 'Value',
       'Flag Codes', 'Flags'],
      dtype='object')

In [59]:
del_cols = ['MEASURE', 'Measure', 'REGIONTYPE', 'Geography Level', 'ASGS_2016',
            'FREQUENCY', 'Frequency', 'TIME', 'Flag Codes', 'Flags']

In [60]:
df.drop(columns=del_cols, inplace=True)

In [62]:
df = df.rename(columns={'Region':'Suburb', 'Time':'Year'})

In [126]:
df.shape

(17062, 3)

In [63]:
df.head()

      Suburb  Year  Value
0  Brunswick  2001  20661
1  Brunswick  2002  20906
2  Brunswick  2003  21015
3  Brunswick  2004  21147
4  Brunswick  2005  21384

In [193]:
# reverse table to col-row

sub_df = df.pivot_table(index=['Suburb'], columns='Year',
                     values='Value', aggfunc='first').reset_index()

In [177]:
#sub_df.info()

In [178]:
sub_df.dropna(how='any', axis=0, inplace=True)

In [170]:
sub_df.describe()

Year,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
count,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000,898.000000
mean,8961.835189,9053.270601,9152.161470,9249.358575,9363.307350,9499.008909,9679.680401,9884.732739,10109.772829,10283.038976,10449.623608,10671.886414,10889.513363,11073.603563,11253.802895,11450.945434,11649.007795,11842.150334,12038.587973
std,5685.827975,5679.815471,5673.242362,5679.373213,5699.081274,5742.094155,5819.899502,5921.744738,6041.857541,6139.257277,6237.572193,6381.161428,6541.223751,6699.386238,6868.804000,7076.149218,7303.173609,7534.487080,7776.912091
min,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000,0.000000
25%,4589.500000,4665.500000,4678.250000,4759.750000,4826.250000,4953.000000,5010.500000,5171.000000,5331.500000,5457.750000,5511.750000,5592.250000,5648.250000,5717.000000,5803.500000,5920.000000,5979.750000,6042.250000,6091.250000
50%,8068.500000,8126.500000,8331.000000,8485.500000,8521.000000,8616.500000,8885.000000,9133.000000,9290.000000,9465.000000,9679.000000,9945.000000,10098.000000,10289.500000,10433.000000,10539.500000,10722.000000,10821.000000,10973.500000
75%,12846.500000,12993.000000,13073.000000,13192.750000,13487.000000,13634.000000,13917.500000,14052.500000,14276.250000,14577.500000,14773.000000,14919.000000,15236.000000,15418.500000,15779.000000,16038.500000,16366.250000,16608.000000,16815.500000
max,26445.000000,26384.000000,26263.000000,26062.000000,25768.000000,25883.000000,26313.000000,26774.000000,27312.000000,27583.000000,27978.000000,29910.000000,31504.000000,33626.000000,37162.000000,40181.000000,45327.000000,49247.000000,51894.000000

In [194]:
sub_df = sub_df[sub_df[2001] != 0]

In [195]:
sub_df.describe()

Year,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
count,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000,870.000000
mean,9250.262069,9344.640230,9446.713793,9547.039080,9664.655172,9804.724138,9991.187356,10202.728736,10434.801149,10613.495402,10785.240230,11014.198851,11238.383908,11428.006897,11613.516092,11816.490805,12020.490805,12219.463218,12421.865517
std,5540.686292,5529.365576,5516.971844,5518.091866,5532.655251,5570.737833,5643.306626,5740.217670,5855.604677,5949.657612,6045.156193,6186.095891,6344.785164,6503.221267,6673.916108,6883.873051,7114.389665,7349.477250,7595.937575
min,3.000000,3.000000,4.000000,5.000000,5.000000,3.000000,4.000000,6.000000,7.000000,9.000000,9.000000,9.000000,7.000000,6.000000,4.000000,3.000000,3.000000,3.000000,3.000000
25%,4836.000000,4894.000000,5007.250000,5140.750000,5199.000000,5283.750000,5349.500000,5466.500000,5690.250000,5711.750000,5841.250000,6015.500000,6073.250000,6103.000000,6194.500000,6290.500000,6312.750000,6409.250000,6457.500000
50%,8311.500000,8441.500000,8643.500000,8782.500000,8930.500000,9012.500000,9187.500000,9465.000000,9657.500000,9836.000000,10012.500000,10067.500000,10342.500000,10490.500000,10731.500000,10803.500000,10916.000000,11027.000000,11161.500000
75%,12947.000000,13109.250000,13170.750000,13412.750000,13585.750000,13795.750000,13983.250000,14204.000000,14346.000000,14741.500000,14949.250000,15117.000000,15701.750000,15834.750000,16008.250000,16377.250000,16622.250000,16809.000000,17096.000000
max,26445.000000,26384.000000,26263.000000,26062.000000,25768.000000,25883.000000,26313.000000,26774.000000,27312.000000,27583.000000,27978.000000,29910.000000,31504.000000,33626.000000,37162.000000,40181.000000,45327.000000,49247.000000,51894.000000

In [202]:
# sub_df['Suburb'] = sub_df['Suburb'].apply(lambda x: x.split(" -"))
# sub_df['Suburb'] = sub_df['Suburb'].apply(lambda x: x[0])
sub_df = sub_df[1:]
sub_df.head()

,Suburb,2001,2002,2003,2004,2005,2006,2007,2008,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
1,Abbotsford,4150,4339,4444,4452,4498,4537,4638,4727,4833,5029,5213,5544,6539,7411,8078,8770,9453,9855,10088
2,Aberfoyle Park,12307,12377,12433,12385,12415,12454,12414,12356,12251,12207,12146,12126,12063,12035,11960,11863,11835,11784,11723
3,Airport West,6997,6970,6952,6904,6870,6878,6920,6983,7067,7175,7234,7301,7390,7521,7694,7903,8032,8280,8559
4,Albany,13971,14019,14047,14088,14173,14218,14230,14254,14274,14298,14324,14503,14630,14635,14663,14622,14490,14402,14286
5,Albany Region,2805,2816,2837,2854,2891,2929,2941,2964,3010,3039,3082,3155,3258,3364,3439,3501,3561,3620,3685

In [203]:
# sub_df.to_csv("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/Vic_Subs_Popu_2001_2019.csv", index=False)

In [204]:
sub_df=pd.read_csv("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/Vic_Subs_Popu_2001_2019.csv")

In [205]:
# sub_df.to_html("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/Vic_Subs_Popu_2001_2019.html")

In [206]:
sub_df.columns

Index(['Suburb', '2001', '2002', '2003', '2004', '2005', '2006', '2007',
       '2008', '2009', '2010', '2011', '2012', '2013', '2014', '2015', '2016',
       '2017', '2018', '2019'],
      dtype='object')

In [207]:
sub_df.drop(columns=['2001', '2002', '2003', '2004', '2005', '2006', '2007',
       '2008'], axis=1, inplace=True)

In [208]:
sub_df.head()

,Suburb,2009,2010,2011,2012,2013,2014,2015,2016,2017,2018,2019
0,Abbotsford,4833,5029,5213,5544,6539,7411,8078,8770,9453,9855,10088
1,Aberfoyle Park,12251,12207,12146,12126,12063,12035,11960,11863,11835,11784,11723
2,Airport West,7067,7175,7234,7301,7390,7521,7694,7903,8032,8280,8559
3,Albany,14274,14298,14324,14503,14630,14635,14663,14622,14490,14402,14286
4,Albany Region,3010,3039,3082,3155,3258,3364,3439,3501,3561,3620,3685

In [209]:
sub_df.to_html("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/Vic_Subs_Popu_2009_2019.html")

In [166]:
#cleaned_df.to_csv("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/Vic_Popu_2001_2019.csv", index=False)

In [ ]:
# loading melbourne house data
df = pd.read_csv("C:/Users/home/Documents/Monu-Hw [KD]/project_3/static/data/MELBOURNE_HOUSE_PRICES_LESS.csv")